rick1082/sdk-nrf/applications/nrf5340_audio/src/bluetooth/le_audio_cis_gateway.c
	ret = channel_index_get(stream->conn, &channel_index);
	if (ret) {
		LOG_ERR("Channel index not found");
		return;
	}

	receive_cb(buf->data, buf->len, bad_frame, info->ts, channel_index,
		   bt_codec_cfg_get_octets_per_frame(stream->codec));
}
#endif /* (CONFIG_BT_AUDIO_RX) */

static struct bt_bap_stream_ops stream_ops = {
	.configured = stream_configured_cb,
	.qos_set = stream_qos_set_cb,
	.enabled = stream_enabled_cb,
	.started = stream_started_cb,
	.metadata_updated = stream_metadata_updated_cb,
	.disabled = stream_disabled_cb,
	.stopped = stream_stopped_cb,
	.released = stream_released_cb,
#if (CONFIG_BT_AUDIO_RX)
	.recv = stream_recv_cb,
#endif /* (CONFIG_BT_AUDIO_RX) */
#if (CONFIG_BT_AUDIO_TX)
	.sent = stream_sent_cb,
#endif /* (CONFIG_BT_AUDIO_TX) */
};

static void work_stream_start(struct k_work *work)
{
	int ret;
	struct worker_data work_data;

	ret = k_msgq_get(&kwork_msgq, &work_data, K_NO_WAIT);
	if (ret) {
		LOG_ERR("Cannot get info for start stream");
		return;
	}

	LOG_DBG("k_msg_get: ch: %d, dir: %d, retries %d", work_data.channel_index, work_data.dir,
		work_data.retries);

	if (work_data.dir == BT_AUDIO_DIR_SINK) {
		ret = bt_bap_stream_start(&headsets[work_data.channel_index].sink_stream);
	} else if (work_data.dir == BT_AUDIO_DIR_SOURCE) {
		ret = bt_bap_stream_start(&headsets[work_data.channel_index].source_stream);
	} else {
		LOG_ERR("Trying to use unknown direction");
		le_audio_event_publish(LE_AUDIO_EVT_NO_VALID_CFG,
				       headsets[work_data.channel_index].headset_conn);

		return;
	}

	work_data.retries++;

	if ((ret == -EBUSY) && (work_data.retries < CIS_CONN_RETRY_TIMES)) {
		LOG_DBG("Got connect error from stream %d Retrying. code: %d count: %d",
			work_data.channel_index, ret, work_data.retries);
		LOG_DBG("k_msg_put: ch: %d, dir: %d, retries %d", work_data.channel_index,
			work_data.dir, work_data.retries);
		ret = k_msgq_put(&kwork_msgq, &work_data, K_NO_WAIT);
		if (ret) {
			LOG_ERR("No space in the queue for work_data");
			return;
		}
		/* Delay added to prevent controller overloading */
		if (work_data.dir == BT_AUDIO_DIR_SINK) {
			k_work_reschedule(&headsets[work_data.channel_index].stream_start_sink_work,
					  K_MSEC(CIS_CONN_RETRY_DELAY_MS));
		} else if (work_data.dir == BT_AUDIO_DIR_SOURCE) {
			k_work_reschedule(
				&headsets[work_data.channel_index].stream_start_source_work,
				K_MSEC(CIS_CONN_RETRY_DELAY_MS));
		}
	} else if (ret != 0) {
		LOG_ERR("Failed to establish CIS, ret = %d", ret);
		/** Defining the connection as having invalid configs, since it is not possible to
		 *  start stream
		 */
		//le_audio_event_publish(LE_AUDIO_EVT_NO_VALID_CFG,
		//		       headsets[work_data.channel_index].headset_conn);
	}
}

/**
 * @brief Set the allocation to a preset codec configuration.
 *
 * @param codec The preset codec configuration.
 * @param loc   Location bitmask setting.
 *
 */
static void bt_codec_allocation_set(struct bt_codec *codec, enum bt_audio_location loc)
{
	for (size_t i = 0; i < codec->data_count; i++) {
		if (codec->data[i].data.type == BT_CODEC_CONFIG_LC3_CHAN_ALLOC) {
			codec->data[i].value[0] = loc & 0xff;
			codec->data[i].value[1] = (loc >> 8) & 0xFFU;
			codec->data[i].value[2] = (loc >> 16) & 0xFFU;
			codec->data[i].value[3] = (loc >> 24) & 0xFFU;
			codec->data[i].data.data = codec->data[i].value;
			return;
		}
	}
}

/**
 * @brief  Check if the gateway can support the headset codec capabilities
 *
 * @note   Currently only the sampling frequency is checked
 *
 * @param  cap_array  The array of pointers to codec capabilities
 * @param  size       The size of cap_array
 *
 * @return True if valid codec capability found, false otherwise
 */
static bool valid_codec_cap_check(struct bt_codec cap_array[], size_t size)
{
	const struct bt_codec_data *element;

	/* Only the sampling frequency is checked */
	for (int i = 0; i < size; i++) {
		if (bt_codec_get_val(&cap_array[i], BT_CODEC_LC3_FREQ, &element)) {
			if (element->data.data[0] & BT_AUDIO_CODEC_CAPABILIY_FREQ) {
				return true;
			}
		}
	}

	return false;
}

static void discover_cb(struct bt_conn *conn, int err, enum bt_audio_dir dir)
{
	int ret;
	uint8_t channel_index = 0;
	uint8_t temp_cap_index;

	if (err == BT_ATT_ERR_ATTRIBUTE_NOT_FOUND) {
		LOG_WRN("No sinks found");
		return;
	} else if (err) {
		LOG_ERR("Discovery failed: %d", err);
		return;
	}

	ret = channel_index_get(conn, &channel_index);
	if (ret) {
		LOG_ERR("Unknown connection, should not reach here");
		return;
	}

	ret = temp_cap_index_get(conn, &temp_cap_index);
	if (ret) {
		LOG_ERR("Could not get temporary CAP storage index");
		return;
	}

	/* At this point the location/channel index of the headset is always known */
	for (int i = 0; i < CONFIG_CODEC_CAP_COUNT_MAX; i++) {
		if (dir == BT_AUDIO_DIR_SINK) {
			memcpy(&headsets[channel_index].sink_codec_cap[i],
			       &temp_cap[temp_cap_index].codec[i], sizeof(struct bt_codec));
		} else {
			memcpy(&headsets[channel_index].source_codec_cap[i],
			       &temp_cap[temp_cap_index].codec[i], sizeof(struct bt_codec));
		}
	}

	if (dir == BT_AUDIO_DIR_SINK) {
		if (valid_codec_cap_check(headsets[channel_index].sink_codec_cap,
					  temp_cap[temp_cap_index].num_caps)) {
			if (conn == headsets[AUDIO_CH_L].headset_conn) {
				bt_codec_allocation_set(&lc3_preset_sink.codec,
							BT_AUDIO_LOCATION_FRONT_LEFT);
			} else if (conn == headsets[AUDIO_CH_R].headset_conn) {
				bt_codec_allocation_set(&lc3_preset_sink.codec,
							BT_AUDIO_LOCATION_FRONT_RIGHT);
			} else {
				LOG_ERR("Unknown connection, cannot set allocation");
			}

			ret = bt_bap_stream_config(conn, &headsets[channel_index].sink_stream,
						   headsets[channel_index].sink_ep,
						   &lc3_preset_sink.codec);
			if (ret) {
				LOG_ERR("Could not configure sink stream, ret = %d", ret);
			}
		} else {
			/* NOTE: The string below is used by the Nordic CI system */
			LOG_WRN("No valid codec capability found for %s headset sink",
				headsets[channel_index].ch_name);
		}
	} else {
		if (valid_codec_cap_check(headsets[channel_index].source_codec_cap,
					  temp_cap[temp_cap_index].num_caps)) {
			if (conn == headsets[AUDIO_CH_L].headset_conn) {
				bt_codec_allocation_set(&lc3_preset_source.codec,
							BT_AUDIO_LOCATION_FRONT_LEFT);
			} else if (conn == headsets[AUDIO_CH_R].headset_conn) {
				bt_codec_allocation_set(&lc3_preset_source.codec,
							BT_AUDIO_LOCATION_FRONT_RIGHT);
			} else {
				LOG_ERR("Unknown connection, cannot set allocation");
			}

